// let a = 5;
// let b = 10;
// console.log(a + b * 5);

// console.log(Math.pow(5, 5));

// let year = 2023;
// let num = 232323;
// console.log(num);
// 1. Вам дана переменная num, присвойте ей значение. Выведите значение этой переменной в консоль.
// 2. Вам даны переменные a=10, b=2 и c=5. Выведите в консоль их сумму.
// 3. Вам дана переменная со значением 100, выведите в консоль умноженную переменную на 2.
// let t = 100;
// console.log(t * 2);
// 4. Вам дана переменная со значением 67. Выведите в консоль остаток деления на 7.
// let f = 67;
// console.log(Math.(f / 7));
// 5. Вам даны переменные a=10 и b=2. Выведите в консоль их сумму, разность, произведение и частное (результат деления).
// 6. Вам даны переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. Выведите в консоль значение переменной result.
// let ba = 15,
//   ca = 2,
//   result = ba + ca;
// console.log(result);

// 7. Вам даны переменные a=30, и b=15 Сложите переменные a и b и результат присвойте переменной c. Затем выведите в консоль остаток деления на 4 переменной c.
// let ber = 30,
//   ver = 15,
//   cer = ber + ver;
// console.log(cer % 4);
// 8. Вам даны переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c. Затем создайте переменную d, присвойте ей значение. Сложите переменные c и d, а результат запишите в переменную result. Выведите в консоль значение переменной result.

let ar = 17,
  br = 10,
  cr = ar - br,
  dr = 1,
  ressult = cr + dr;
console.log(ressult);
